The view id.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ElementId ViewId { get; }
  Visual Basic
Public ReadOnly Property ViewId As ElementId
	Get
  Visual C++
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
 See Also
  ElementOwnerViewFilter Class
  Autodesk.Revit.DB Namespace